In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [20]:
cu = pd.read_csv("Customers.csv",sep = ";")
ord = pd.read_csv("orders.csv",sep = ";")
pro = pd.read_csv("products.csv",sep = ";")

In [28]:
# change first name as customer name
cu = cu.rename(columns={"First_Name":"Customer_Name"})
cu.head(2)

,Customer_ID,Customer_Name,Last_Name,Postal_Code,City,Country,Score
0,1,Bill,Van Buren,78000,Versailles,France,76
1,2,Gerald,Jackson,60528,Frankfurt a.M.,Germany,74

In [32]:
# CONVERTNG TO UPPER
cu['Customer_Name'] =  cu['Customer_Name'].str.upper()
cu.head(2)

,Customer_ID,Customer_Name,Last_Name,Postal_Code,City,Country,Score
0,1,BILL,Van Buren,78000,Versailles,France,76
1,2,GERALD,Jackson,60528,Frankfurt a.M.,Germany,74

In [38]:
# UNIQ CUSTOMERS
uniq = cu['Customer_Name'].unique()
uniq

array(['BILL', 'GERALD', 'HARRY', 'DWIGHT', 'RUTHERFORD', 'GROVER',
       'CALVIN', 'ULYSSES', 'JIMMY', 'JAMES', 'RONALD', 'MARTIN', 'JOHN',
       'FRANKLIN', 'BENJAMIN', 'CHESTER', 'WARREN', 'MILLARD', 'HERBERT',
       'WOODROW', 'ANDREW', 'RICHARD', 'ZACHARY', 'THOMAS', 'WILLIAM',
       'ABRAHAM', 'GEORGE', 'THEODORE', 'LYNDON'], dtype=object)

In [44]:
# FIRST 3 CHAR similary other charactier s can be extracted
cu['first_3'] = cu['Customer_Name'].str[:3]

In [ ]:
# trim in 
df['RTRIM_NAMe'] = df['Customer_Name'].str.rstrip()
df['lTRIM_NAMe'] = df['Customer_Name'].str.lstrip()
df['lTRIM_NAMe'] = df['Customer_Name'].str.strip()

In [ ]:
# removing spaces in between
df['NO_SPACES'] = df['FULL_NAME'].str.replace(" ", "", regex=False)

In [54]:
# find character
cu["find R"] = cu["Customer_Name"].str.find('R')+1 # since zero based indexing
cu.head()

,Customer_ID,Customer_Name,Last_Name,Postal_Code,City,Country,Score,first_3,find r,find R
0,1,BILL,Van Buren,78000,Versailles,France,76,BIL,-1,0
1,2,GERALD,Jackson,60528,Frankfurt a.M.,Germany,74,GER,-1,3
2,3,HARRY,Nixon,75016,Paris,France,3,HAR,-1,3
3,4,DWIGHT,Coolidge,97219,Portland,USA,25,DWI,-1,0
4,5,RUTHERFORD,Roosevelt,4179,Leipzig,Germany,87,RUT,-1,1

In [86]:
# distinct withcu length Because .drop_duplicates() behaves differently depending on the type:
#If you use a Series, it'll drop duplicate values in that Series only.
#If you use a DataFrame, you can preserve the full 2D structure, which is useful when selecting multiple columns (even if it's just one now).

cu_dist = cu[["City"]].drop_duplicates()
cu_dist["count"] = cu_dist["City"].str.len()
cu_dist[:]
cu_dist_order = cu_dist.sort_values(by='count', ascending=False)
cu_dist_order.iloc[:5,:1]

              City
1   Frankfurt a.M.
28   Reggio Emilia
18   San Francisco
24     Brandenburg
19     Albuquerque

In [92]:
cu['COMPLETE_NAME'] = cu['Customer_Name'] + " " + cu['Last_Name']

In [104]:
# ISIN 
fil_cu = cu[cu['Customer_Name'].isin(['BILL','HARRY'])]
# not in
fil_cu_no = cu[~cu['Customer_Name'].isin(['BILL','HARRY'])]